# encoding: utf-8
class Ascii
  def self.convert(text)
    text.gsub(REG_CONVERT) { |char| CUSTOM_CONV_MAP[char] }
  end

  def self.slug(text, options = {})
    # DEV NOT: care, simple space and insecable space
    result = convert(text.to_s).gsub(/['’  _-]+/, '-').gsub(/[^\w-]+/, '').gsub(/--+/, '-').gsub(/^-|-$/, '')
    return result unless options[:max_len]
    while result.length > options[:max_len]
      pos = result.rindex('-')
      result = (pos ? result[0, pos] : result[0, options[:max_len]])
    end
    result
  end

private
  #REG_STRIP = /['‘’“”«»]+/

  CUSTOM_CONV_MAP = {
    'á' => 'a', 'à' => 'a', 'â' => 'a', 'ä' => 'a', 'ã' => 'a', 'å' => 'a', 'ā' => 'a', 'ą' => 'a', 'ă' => 'a',
    'æ' => 'ae',
    'ç' => 'c', 'ć' => 'c', 'č' => 'c', 'ĉ' => 'c', 'ċ' => 'c', 
    'ð' => 'd', 'ď' => 'd', 'đ' => 'd', 
    'é' => 'e', 'è' => 'e', 'ê' => 'e', 'ë' => 'e', 'ē' => 'e', 'ę' => 'e', 'ě' => 'e', 'ĕ' => 'e', 'ė' => 'e',
    'ƒ' => 'f', 'ſ' => 'f',
    'ĝ' => 'g', 'ğ' => 'g', 'ġ' => 'g', 'ģ' => 'g',
    'ĥ' => 'h', 'ħ' => 'h',
    'í' => 'i', 'ì' => 'i', 'î' => 'i', 'ï' => 'i', 'ī' => 'i', 'ĩ' => 'i', 'ĭ' => 'i', 'į' => 'i', 'ı' => 'i',
    'ĳ' => 'ij',
    'ĵ' => 'j',
    'ķ' => 'k', 'ĸ' => 'k', 
    'ł' => 'l', 'ľ' => 'l', 'ĺ' => 'l', 'ļ' => 'l', 'ŀ' => 'l',
    'ñ' => 'n', 'ń' => 'n', 'ň' => 'n', 'ņ' => 'n', 'ŉ' => 'n', 'ŋ' => 'n',
    'ó' => 'o', 'ò' => 'o', 'ô' => 'o', 'ö' => 'o', 'õ' => 'o', 'ø' => 'o', 'ō' => 'o', 'ő' => 'o', 'ŏ' => 'o',
    'œ' => 'oe',
    'Þ' => 'p',
    'ŕ' => 'r', 'ř' => 'r', 'ŗ' => 'r',
    'ś' => 's', 'š' => 's', 'ş' => 's', 'ŝ' => 's', 'ș' => 's',
    'ß' => 'ss',
    'ť' => 't', 'ţ' => 't', 'ŧ' => 't', 'ț' => 't',
    'ú' => 'u', 'ù' => 'u', 'û' => 'u', 'ü' => 'u', 'ū' => 'u', 'ů' => 'u', 'ű' => 'u', 'ŭ' => 'u', 'ũ' => 'u', 'ų' => 'u',
    'ŵ' => 'w',
    'ý' => 'y', 'ŷ' => 'y', 'ÿ' => 'y',
    'ž' => 'z', 'ż' => 'z', 'ź' => 'z',


    'Á' => 'A', 'À' => 'A', 'Â' => 'A', 'Ä' => 'A', 'Ã' => 'A', 'Å' => 'A', 'Ā' => 'A', 'Ą' => 'A', 'Ă' => 'A',
    'Æ' => 'AE',
    'Ç' => 'C', 'Ć' => 'C', 'Č' => 'C', 'Ĉ' => 'C', 'Ċ' => 'C',
    'Ð' => 'D', 'Ď' => 'D', 'Đ' => 'D',
    'É' => 'E', 'È' => 'E', 'Ê' => 'E', 'Ë' => 'E', 'Ē' => 'E', 'Ę' => 'E', 'Ě' => 'E', 'Ĕ' => 'E', 'Ė' => 'E',
    'Ƒ' => 'F',
    'Ĝ' => 'G', 'Ğ' => 'G', 'Ġ' => 'G', 'Ģ' => 'G',
    'Ĥ' => 'H', 'Ħ' => 'H',
    'Í' => 'I', 'Ì' => 'I', 'Î' =>'I', 'Ï' => 'I', 'Ī' => 'I', 'Ĩ' => 'I', 'Ĭ' => 'I', 'Į' => 'I', 'İ' => 'I',
    'Ĳ' => 'IJ',
    'Ĵ' => 'J',
    'Ķ' => 'K',
    'Ł' => 'L', 'Ľ' => 'L', 'Ĺ' => 'L', 'Ļ' => 'L', 'Ŀ' => 'L',
    'Ñ' => 'N', 'Ń' => 'N', 'Ň' => 'N', 'Ņ' => 'N', 'Ŋ' => 'N',
    'Ó' => 'O', 'Ò' => 'O', 'Ô' => 'O', 'Ö' => 'O', 'Õ' => 'O', 'Ø' => 'O', 'Ō' => 'O', 'Ő' => 'O', 'Ŏ' => 'O',
    'Œ' => 'OE',
    'þ' => 'P',
    'Ŕ' => 'R', 'Ř' => 'R', 'Ŗ' => 'R',
    'Ś' => 'S', 'Š' => 'S', 'Ş' => 'S', 'Ŝ' => 'S', 'Ș' => 'S',
    'Ť' => 'T', 'Ţ' => 'T', 'Ŧ' => 'T', 'Ț' => 'T',
    'Ú' => 'U', 'Ù' => 'U', 'Û' => 'U', 'Ü' => 'U', 'Ū' => 'U', 'Ů' => 'U', 'Ű' => 'U', 'Ŭ' => 'U', 'Ũ' => 'U', 'Ų' => 'U',
    'Ŵ' => 'W',
    'Ý' => 'Y', 'Ŷ' => 'Y', 'Ÿ' => 'Y',
    'Ź' => 'Z', 'Ž' => 'Z', 'Ż' => 'Z'
  }

  REG_CONVERT = Regexp.new("[#{CUSTOM_CONV_MAP.keys.join('')}]")

end

